adafruit/seesaw/lib/samd51/samd51a/edc/ATSAMD51P20A.PIC
      <edc:SFRDef edc:_addr="0x40000020" edc:access="--------------------nnnnnnnnnnnn" edc:cname="INTFLAGD" edc:impl="0xFFF" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="PAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PAC">
            <edc:SFRFieldDef edc:cname="SERCOM4_" edc:desc="SERCOM4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SERCOM5_" edc:desc="SERCOM5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SERCOM6_" edc:desc="SERCOM6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SERCOM7_" edc:desc="SERCOM7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TCC4_" edc:desc="TCC4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TC6_" edc:desc="TC6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TC7_" edc:desc="TC7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ADC0_" edc:desc="ADC0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ADC1_" edc:desc="ADC1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DAC_" edc:desc="DAC" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="I2S_" edc:desc="I2S" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PCC_" edc:desc="PCC" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x40000024" edc:offset="0x10"/>
      <edc:SFRDef edc:_addr="0x40000034" edc:access="----------------rrrrrrrrrrrrrrrr" edc:cname="STATUSA" edc:impl="0xFFFF" edc:mclr="00000000000000010000000000000000" edc:nzwidth="0x20" edc:por="00000000000000010000000000000000" ltx:memberofperipheral="PAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PAC">
            <edc:SFRFieldDef edc:cname="PAC_" edc:desc="PAC APB Protect Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PM_" edc:desc="PM APB Protect Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="MCLK_" edc:desc="MCLK APB Protect Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RSTC_" edc:desc="RSTC APB Protect Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OSCCTRL_" edc:desc="OSCCTRL APB Protect Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OSC32KCTRL_" edc:desc="OSC32KCTRL APB Protect Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SUPC_" edc:desc="SUPC APB Protect Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="GCLK_" edc:desc="GCLK APB Protect Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="WDT_" edc:desc="WDT APB Protect Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RTC_" edc:desc="RTC APB Protect Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EIC_" edc:desc="EIC APB Protect Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FREQM_" edc:desc="FREQM APB Protect Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SERCOM0_" edc:desc="SERCOM0 APB Protect Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SERCOM1_" edc:desc="SERCOM1 APB Protect Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TC0_" edc:desc="TC0 APB Protect Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TC1_" edc:desc="TC1 APB Protect Enable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40000038" edc:access="---------------r-rrrrrr-rrrrrrrr" edc:cname="STATUSB" edc:impl="0x17EFF" edc:mclr="00000000000000000000000000000010" edc:nzwidth="0x20" edc:por="00000000000000000000000000000010" ltx:memberofperipheral="PAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PAC">
            <edc:SFRFieldDef edc:cname="USB_" edc:desc="USB APB Protect Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DSU_" edc:desc="DSU APB Protect Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="NVMCTRL_" edc:desc="NVMCTRL APB Protect Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CMCC_" edc:desc="CMCC APB Protect Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PORT_" edc:desc="PORT APB Protect Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DMAC_" edc:desc="DMAC APB Protect Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="HMATRIX_" edc:desc="HMATRIX APB Protect Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EVSYS_" edc:desc="EVSYS APB Protect Enable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="SERCOM2_" edc:desc="SERCOM2 APB Protect Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SERCOM3_" edc:desc="SERCOM3 APB Protect Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TCC0_" edc:desc="TCC0 APB Protect Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TCC1_" edc:desc="TCC1 APB Protect Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TC2_" edc:desc="TC2 APB Protect Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TC3_" edc:desc="TC3 APB Protect Enable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="RAMECC_" edc:desc="RAMECC APB Protect Enable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4000003C" edc:access="-----------------rrrrrrrrrrrr---" edc:cname="STATUSC" edc:impl="0x7FF8" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="PAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PAC">
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="TCC2_" edc:desc="TCC2 APB Protect Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TCC3_" edc:desc="TCC3 APB Protect Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TC4_" edc:desc="TC4 APB Protect Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TC5_" edc:desc="TC5 APB Protect Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PDEC_" edc:desc="PDEC APB Protect Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AC_" edc:desc="AC APB Protect Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AES_" edc:desc="AES APB Protect Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TRNG_" edc:desc="TRNG APB Protect Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ICM_" edc:desc="ICM APB Protect Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PUKCC_" edc:desc="PUKCC APB Protect Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="QSPI_" edc:desc="QSPI APB Protect Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CCL_" edc:desc="CCL APB Protect Enable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
