adafruit/seesaw/lib/samd51/samd51a/edc/ATSAMD51P20A.PIC
      <edc:SFRDef edc:_addr="0x410081B1" edc:access="nnnnnnnn" edc:cname="GROUP3PMUX1" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="PORT">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PORT">
            <edc:SFRFieldDef edc:cname="PMUXE" edc:desc="Peripheral Multiplexing for Even-Numbered Pin" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="PMUXO" edc:desc="Peripheral Multiplexing for Odd-Numbered Pin" edc:nzwidth="0x4"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x410081B2" edc:access="nnnnnnnn" edc:cname="GROUP3PMUX2" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="PORT">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PORT">
            <edc:SFRFieldDef edc:cname="PMUXE" edc:desc="Peripheral Multiplexing for Even-Numbered Pin" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="PMUXO" edc:desc="Peripheral Multiplexing for Odd-Numbered Pin" edc:nzwidth="0x4"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x410081B3" edc:access="nnnnnnnn" edc:cname="GROUP3PMUX3" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="PORT">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PORT">
            <edc:SFRFieldDef edc:cname="PMUXE" edc:desc="Peripheral Multiplexing for Even-Numbered Pin" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="PMUXO" edc:desc="Peripheral Multiplexing for Odd-Numbered Pin" edc:nzwidth="0x4"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x410081B4" edc:access="nnnnnnnn" edc:cname="GROUP3PMUX4" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="PORT">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PORT">
            <edc:SFRFieldDef edc:cname="PMUXE" edc:desc="Peripheral Multiplexing for Even-Numbered Pin" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="PMUXO" edc:desc="Peripheral Multiplexing for Odd-Numbered Pin" edc:nzwidth="0x4"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x410081B5" edc:access="nnnnnnnn" edc:cname="GROUP3PMUX5" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="PORT">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PORT">
            <edc:SFRFieldDef edc:cname="PMUXE" edc:desc="Peripheral Multiplexing for Even-Numbered Pin" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="PMUXO" edc:desc="Peripheral Multiplexing for Odd-Numbered Pin" edc:nzwidth="0x4"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x410081B6" edc:access="nnnnnnnn" edc:cname="GROUP3PMUX6" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="PORT">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PORT">
            <edc:SFRFieldDef edc:cname="PMUXE" edc:desc="Peripheral Multiplexing for Even-Numbered Pin" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="PMUXO" edc:desc="Peripheral Multiplexing for Odd-Numbered Pin" edc:nzwidth="0x4"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x410081B7" edc:access="nnnnnnnn" edc:cname="GROUP3PMUX7" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="PORT">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PORT">
            <edc:SFRFieldDef edc:cname="PMUXE" edc:desc="Peripheral Multiplexing for Even-Numbered Pin" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="PMUXO" edc:desc="Peripheral Multiplexing for Odd-Numbered Pin" edc:nzwidth="0x4"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x410081B8" edc:access="nnnnnnnn" edc:cname="GROUP3PMUX8" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="PORT">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PORT">
            <edc:SFRFieldDef edc:cname="PMUXE" edc:desc="Peripheral Multiplexing for Even-Numbered Pin" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="PMUXO" edc:desc="Peripheral Multiplexing for Odd-Numbered Pin" edc:nzwidth="0x4"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x410081B9" edc:access="nnnnnnnn" edc:cname="GROUP3PMUX9" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="PORT">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PORT">
            <edc:SFRFieldDef edc:cname="PMUXE" edc:desc="Peripheral Multiplexing for Even-Numbered Pin" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="PMUXO" edc:desc="Peripheral Multiplexing for Odd-Numbered Pin" edc:nzwidth="0x4"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x410081BA" edc:access="nnnnnnnn" edc:cname="GROUP3PMUX10" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="PORT">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PORT">
            <edc:SFRFieldDef edc:cname="PMUXE" edc:desc="Peripheral Multiplexing for Even-Numbered Pin" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="PMUXO" edc:desc="Peripheral Multiplexing for Odd-Numbered Pin" edc:nzwidth="0x4"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x410081BB" edc:access="nnnnnnnn" edc:cname="GROUP3PMUX11" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="PORT">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PORT">
            <edc:SFRFieldDef edc:cname="PMUXE" edc:desc="Peripheral Multiplexing for Even-Numbered Pin" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="PMUXO" edc:desc="Peripheral Multiplexing for Odd-Numbered Pin" edc:nzwidth="0x4"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x410081BC" edc:access="nnnnnnnn" edc:cname="GROUP3PMUX12" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="PORT">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PORT">
            <edc:SFRFieldDef edc:cname="PMUXE" edc:desc="Peripheral Multiplexing for Even-Numbered Pin" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="PMUXO" edc:desc="Peripheral Multiplexing for Odd-Numbered Pin" edc:nzwidth="0x4"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x410081BD" edc:access="nnnnnnnn" edc:cname="GROUP3PMUX13" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="PORT">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PORT">
            <edc:SFRFieldDef edc:cname="PMUXE" edc:desc="Peripheral Multiplexing for Even-Numbered Pin" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="PMUXO" edc:desc="Peripheral Multiplexing for Odd-Numbered Pin" edc:nzwidth="0x4"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x410081BE" edc:access="nnnnnnnn" edc:cname="GROUP3PMUX14" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="PORT">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PORT">
            <edc:SFRFieldDef edc:cname="PMUXE" edc:desc="Peripheral Multiplexing for Even-Numbered Pin" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="PMUXO" edc:desc="Peripheral Multiplexing for Odd-Numbered Pin" edc:nzwidth="0x4"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x410081BF" edc:access="nnnnnnnn" edc:cname="GROUP3PMUX15" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="PORT">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PORT">
            <edc:SFRFieldDef edc:cname="PMUXE" edc:desc="Peripheral Multiplexing for Even-Numbered Pin" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="PMUXO" edc:desc="Peripheral Multiplexing for Odd-Numbered Pin" edc:nzwidth="0x4"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x410081C0" edc:access="-n---nnn" edc:cname="GROUP3PINCFG0" edc:impl="0x47" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="PORT">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PORT">
            <edc:SFRFieldDef edc:cname="PMUXEN" edc:desc="Peripheral Multiplexer Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="INEN" edc:desc="Input Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PULLEN" edc:desc="Pull Enable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="DRVSTR" edc:desc="Output Driver Strength Selection" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x410081C1" edc:access="-n---nnn" edc:cname="GROUP3PINCFG1" edc:impl="0x47" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="PORT">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PORT">
            <edc:SFRFieldDef edc:cname="PMUXEN" edc:desc="Peripheral Multiplexer Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="INEN" edc:desc="Input Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PULLEN" edc:desc="Pull Enable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="DRVSTR" edc:desc="Output Driver Strength Selection" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
