adafruit/seesaw/lib/samd51/samd51a/edc/ATSAMD51P20A.PIC
      <edc:SFRDef edc:_addr="0x410081C2" edc:access="-n---nnn" edc:cname="GROUP3PINCFG2" edc:impl="0x47" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="PORT">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PORT">
            <edc:SFRFieldDef edc:cname="PMUXEN" edc:desc="Peripheral Multiplexer Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="INEN" edc:desc="Input Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PULLEN" edc:desc="Pull Enable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="DRVSTR" edc:desc="Output Driver Strength Selection" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x410081C3" edc:access="-n---nnn" edc:cname="GROUP3PINCFG3" edc:impl="0x47" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="PORT">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PORT">
            <edc:SFRFieldDef edc:cname="PMUXEN" edc:desc="Peripheral Multiplexer Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="INEN" edc:desc="Input Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PULLEN" edc:desc="Pull Enable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="DRVSTR" edc:desc="Output Driver Strength Selection" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x410081C4" edc:access="-n---nnn" edc:cname="GROUP3PINCFG4" edc:impl="0x47" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="PORT">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PORT">
            <edc:SFRFieldDef edc:cname="PMUXEN" edc:desc="Peripheral Multiplexer Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="INEN" edc:desc="Input Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PULLEN" edc:desc="Pull Enable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="DRVSTR" edc:desc="Output Driver Strength Selection" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x410081C5" edc:access="-n---nnn" edc:cname="GROUP3PINCFG5" edc:impl="0x47" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="PORT">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PORT">
            <edc:SFRFieldDef edc:cname="PMUXEN" edc:desc="Peripheral Multiplexer Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="INEN" edc:desc="Input Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PULLEN" edc:desc="Pull Enable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="DRVSTR" edc:desc="Output Driver Strength Selection" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x410081C6" edc:access="-n---nnn" edc:cname="GROUP3PINCFG6" edc:impl="0x47" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="PORT">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PORT">
            <edc:SFRFieldDef edc:cname="PMUXEN" edc:desc="Peripheral Multiplexer Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="INEN" edc:desc="Input Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PULLEN" edc:desc="Pull Enable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="DRVSTR" edc:desc="Output Driver Strength Selection" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x410081C7" edc:access="-n---nnn" edc:cname="GROUP3PINCFG7" edc:impl="0x47" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="PORT">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PORT">
            <edc:SFRFieldDef edc:cname="PMUXEN" edc:desc="Peripheral Multiplexer Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="INEN" edc:desc="Input Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PULLEN" edc:desc="Pull Enable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="DRVSTR" edc:desc="Output Driver Strength Selection" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x410081C8" edc:access="-n---nnn" edc:cname="GROUP3PINCFG8" edc:impl="0x47" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="PORT">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PORT">
            <edc:SFRFieldDef edc:cname="PMUXEN" edc:desc="Peripheral Multiplexer Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="INEN" edc:desc="Input Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PULLEN" edc:desc="Pull Enable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="DRVSTR" edc:desc="Output Driver Strength Selection" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x410081C9" edc:access="-n---nnn" edc:cname="GROUP3PINCFG9" edc:impl="0x47" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="PORT">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PORT">
            <edc:SFRFieldDef edc:cname="PMUXEN" edc:desc="Peripheral Multiplexer Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="INEN" edc:desc="Input Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PULLEN" edc:desc="Pull Enable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="DRVSTR" edc:desc="Output Driver Strength Selection" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x410081CA" edc:access="-n---nnn" edc:cname="GROUP3PINCFG10" edc:impl="0x47" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="PORT">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PORT">
            <edc:SFRFieldDef edc:cname="PMUXEN" edc:desc="Peripheral Multiplexer Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="INEN" edc:desc="Input Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PULLEN" edc:desc="Pull Enable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="DRVSTR" edc:desc="Output Driver Strength Selection" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x410081CB" edc:access="-n---nnn" edc:cname="GROUP3PINCFG11" edc:impl="0x47" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="PORT">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PORT">
            <edc:SFRFieldDef edc:cname="PMUXEN" edc:desc="Peripheral Multiplexer Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="INEN" edc:desc="Input Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PULLEN" edc:desc="Pull Enable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="DRVSTR" edc:desc="Output Driver Strength Selection" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
