adafruit/seesaw/lib/samd51/samd51a/edc/ATSAMD51P20A.PIC
      <edc:AdjustPoint edc:_addr="0x43001C42" edc:offset="0x2"/>
      <edc:SFRDef edc:_addr="0x43001C44" edc:access="rrrrrrrrrrrrrrrr" edc:cname="RESS" edc:mclr="0000000000000000" edc:nzwidth="0x10" edc:por="0000000000000000" ltx:memberofperipheral="ADC0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ADC0">
            <edc:SFRFieldDef edc:cname="RESS" edc:desc="Last ADC conversion result" edc:nzwidth="0x10"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x43001C46" edc:offset="0x2"/>
      <edc:SFRDef edc:_addr="0x43001C48" edc:access="-----nnn-nnn-nnn" edc:cname="CALIB" edc:impl="0x777" edc:mclr="0000000000000000" edc:nzwidth="0x10" edc:por="0000000000000000" ltx:memberofperipheral="ADC0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ADC0">
            <edc:SFRFieldDef edc:cname="BIASCOMP" edc:desc="Bias Comparator Scaling" edc:nzwidth="0x3"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="BIASR2R" edc:desc="Bias R2R Ampli scaling" edc:nzwidth="0x3"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="BIASREFBUF" edc:desc="Bias  Reference Buffer Scaling" edc:nzwidth="0x3"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x43001C4A" edc:offset="0x3B6"/>
      <edc:SFRDef edc:_addr="0x43002000" edc:access="n----nnnnnnnn-nn" edc:cname="CTRLA" edc:impl="0x87FB" edc:mclr="0000000000000000" edc:nzwidth="0x10" edc:por="0000000000000000" ltx:memberofperipheral="ADC1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ADC1">
            <edc:SFRFieldDef edc:cname="SWRST" edc:desc="Software Reset" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ENABLE" edc:desc="Enable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="DUALSEL" edc:desc="Dual Mode Trigger Selection" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="BOTH" edc:desc="Start event or software trigger will start a conversion on both ADCs" edc:when="(field &amp; 0x3) == 0"/>
              <edc:SFRFieldSemantic edc:cname="INTERLEAVE" edc:desc="START event or software trigger will alternatingly start a conversion on ADC0 and ADC1" edc:when="(field &amp; 0x3) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="SLAVEEN" edc:desc="Slave Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RUNSTDBY" edc:desc="Run in Standby" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ONDEMAND" edc:desc="On Demand Control" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PRESCALER" edc:desc="Prescaler Configuration" edc:nzwidth="0x3">
              <edc:SFRFieldSemantic edc:cname="DIV2" edc:desc="Peripheral clock divided by 2" edc:when="(field &amp; 0x7) == 0"/>
              <edc:SFRFieldSemantic edc:cname="DIV4" edc:desc="Peripheral clock divided by 4" edc:when="(field &amp; 0x7) == 1"/>
              <edc:SFRFieldSemantic edc:cname="DIV8" edc:desc="Peripheral clock divided by 8" edc:when="(field &amp; 0x7) == 2"/>
              <edc:SFRFieldSemantic edc:cname="DIV16" edc:desc="Peripheral clock divided by 16" edc:when="(field &amp; 0x7) == 3"/>
              <edc:SFRFieldSemantic edc:cname="DIV32" edc:desc="Peripheral clock divided by 32" edc:when="(field &amp; 0x7) == 4"/>
              <edc:SFRFieldSemantic edc:cname="DIV64" edc:desc="Peripheral clock divided by 64" edc:when="(field &amp; 0x7) == 5"/>
              <edc:SFRFieldSemantic edc:cname="DIV128" edc:desc="Peripheral clock divided by 128" edc:when="(field &amp; 0x7) == 6"/>
              <edc:SFRFieldSemantic edc:cname="DIV256" edc:desc="Peripheral clock divided by 256" edc:when="(field &amp; 0x7) == 7"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="R2R" edc:desc="Rail to Rail Operation Enable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x43002002" edc:access="--nnnnnn" edc:cname="EVCTRL" edc:impl="0x3F" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="ADC1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ADC1">
            <edc:SFRFieldDef edc:cname="FLUSHEI" edc:desc="Flush Event Input Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="STARTEI" edc:desc="Start Conversion Event Input Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FLUSHINV" edc:desc="Flush Event Invert Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="STARTINV" edc:desc="Start Conversion Event Invert Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RESRDYEO" edc:desc="Result Ready Event Out" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="WINMONEO" edc:desc="Window Monitor Event Out" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x43002003" edc:access="-------n" edc:cname="DBGCTRL" edc:impl="0x1" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="ADC1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ADC1">
            <edc:SFRFieldDef edc:cname="DBGRUN" edc:desc="Debug Run" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x43002004" edc:access="n--nnnnnn--nnnnn" edc:cname="INPUTCTRL" edc:impl="0x9F9F" edc:mclr="0000000000000000" edc:nzwidth="0x10" edc:por="0000000000000000" ltx:memberofperipheral="ADC1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ADC1">
            <edc:SFRFieldDef edc:cname="MUXPOS" edc:desc="Positive Mux Input Selection" edc:nzwidth="0x5">
              <edc:SFRFieldSemantic edc:cname="AIN0" edc:desc="ADC AIN0 Pin" edc:when="(field &amp; 0x1F) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="AIN1" edc:desc="ADC AIN1 Pin" edc:when="(field &amp; 0x1F) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="AIN2" edc:desc="ADC AIN2 Pin" edc:when="(field &amp; 0x1F) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="AIN3" edc:desc="ADC AIN3 Pin" edc:when="(field &amp; 0x1F) == 0x3"/>
              <edc:SFRFieldSemantic edc:cname="AIN4" edc:desc="ADC AIN4 Pin" edc:when="(field &amp; 0x1F) == 0x4"/>
              <edc:SFRFieldSemantic edc:cname="AIN5" edc:desc="ADC AIN5 Pin" edc:when="(field &amp; 0x1F) == 0x5"/>
              <edc:SFRFieldSemantic edc:cname="AIN6" edc:desc="ADC AIN6 Pin" edc:when="(field &amp; 0x1F) == 0x6"/>
              <edc:SFRFieldSemantic edc:cname="AIN7" edc:desc="ADC AIN7 Pin" edc:when="(field &amp; 0x1F) == 0x7"/>
              <edc:SFRFieldSemantic edc:cname="AIN8" edc:desc="ADC AIN8 Pin" edc:when="(field &amp; 0x1F) == 0x8"/>
              <edc:SFRFieldSemantic edc:cname="AIN9" edc:desc="ADC AIN9 Pin" edc:when="(field &amp; 0x1F) == 0x9"/>
              <edc:SFRFieldSemantic edc:cname="AIN10" edc:desc="ADC AIN10 Pin" edc:when="(field &amp; 0x1F) == 0xA"/>
              <edc:SFRFieldSemantic edc:cname="AIN11" edc:desc="ADC AIN11 Pin" edc:when="(field &amp; 0x1F) == 0xB"/>
              <edc:SFRFieldSemantic edc:cname="AIN12" edc:desc="ADC AIN12 Pin" edc:when="(field &amp; 0x1F) == 0xC"/>
              <edc:SFRFieldSemantic edc:cname="AIN13" edc:desc="ADC AIN13 Pin" edc:when="(field &amp; 0x1F) == 0xD"/>
              <edc:SFRFieldSemantic edc:cname="AIN14" edc:desc="ADC AIN14 Pin" edc:when="(field &amp; 0x1F) == 0xE"/>
              <edc:SFRFieldSemantic edc:cname="AIN15" edc:desc="ADC AIN15 Pin" edc:when="(field &amp; 0x1F) == 0xF"/>
              <edc:SFRFieldSemantic edc:cname="AIN16" edc:desc="ADC AIN16 Pin" edc:when="(field &amp; 0x1F) == 0x10"/>
              <edc:SFRFieldSemantic edc:cname="AIN17" edc:desc="ADC AIN17 Pin" edc:when="(field &amp; 0x1F) == 0x11"/>
              <edc:SFRFieldSemantic edc:cname="AIN18" edc:desc="ADC AIN18 Pin" edc:when="(field &amp; 0x1F) == 0x12"/>
              <edc:SFRFieldSemantic edc:cname="AIN19" edc:desc="ADC AIN19 Pin" edc:when="(field &amp; 0x1F) == 0x13"/>
              <edc:SFRFieldSemantic edc:cname="AIN20" edc:desc="ADC AIN20 Pin" edc:when="(field &amp; 0x1F) == 0x14"/>
              <edc:SFRFieldSemantic edc:cname="AIN21" edc:desc="ADC AIN21 Pin" edc:when="(field &amp; 0x1F) == 0x15"/>
              <edc:SFRFieldSemantic edc:cname="AIN22" edc:desc="ADC AIN22 Pin" edc:when="(field &amp; 0x1F) == 0x16"/>
              <edc:SFRFieldSemantic edc:cname="AIN23" edc:desc="ADC AIN23 Pin" edc:when="(field &amp; 0x1F) == 0x17"/>
              <edc:SFRFieldSemantic edc:cname="SCALEDCOREVCC" edc:desc="1/4 Scaled Core Supply" edc:when="(field &amp; 0x1F) == 0x18"/>
              <edc:SFRFieldSemantic edc:cname="SCALEDVBAT" edc:desc="1/4 Scaled VBAT Supply" edc:when="(field &amp; 0x1F) == 0x19"/>
              <edc:SFRFieldSemantic edc:cname="SCALEDIOVCC" edc:desc="1/4 Scaled I/O Supply" edc:when="(field &amp; 0x1F) == 0x1A"/>
              <edc:SFRFieldSemantic edc:cname="BANDGAP" edc:desc="Bandgap Voltage" edc:when="(field &amp; 0x1F) == 0x1B"/>
              <edc:SFRFieldSemantic edc:cname="PTAT" edc:desc="Temperature Sensor" edc:when="(field &amp; 0x1F) == 0x1C"/>
              <edc:SFRFieldSemantic edc:cname="CTAT" edc:desc="Temperature Sensor" edc:when="(field &amp; 0x1F) == 0x1D"/>
              <edc:SFRFieldSemantic edc:cname="DAC" edc:desc="DAC Output" edc:when="(field &amp; 0x1F) == 0x1E"/>
              <edc:SFRFieldSemantic edc:cname="PTC" edc:desc="PTC output (only on ADC0)" edc:when="(field &amp; 0x1F) == 0x1F"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="DIFFMODE" edc:desc="Differential Mode" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="MUXNEG" edc:desc="Negative Mux Input Selection" edc:nzwidth="0x5">
              <edc:SFRFieldSemantic edc:cname="AIN0" edc:desc="ADC AIN0 Pin" edc:when="(field &amp; 0x1F) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="AIN1" edc:desc="ADC AIN1 Pin" edc:when="(field &amp; 0x1F) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="AIN2" edc:desc="ADC AIN2 Pin" edc:when="(field &amp; 0x1F) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="AIN3" edc:desc="ADC AIN3 Pin" edc:when="(field &amp; 0x1F) == 0x3"/>
              <edc:SFRFieldSemantic edc:cname="AIN4" edc:desc="ADC AIN4 Pin" edc:when="(field &amp; 0x1F) == 0x4"/>
              <edc:SFRFieldSemantic edc:cname="AIN5" edc:desc="ADC AIN5 Pin" edc:when="(field &amp; 0x1F) == 0x5"/>
              <edc:SFRFieldSemantic edc:cname="AIN6" edc:desc="ADC AIN6 Pin" edc:when="(field &amp; 0x1F) == 0x6"/>
              <edc:SFRFieldSemantic edc:cname="AIN7" edc:desc="ADC AIN7 Pin" edc:when="(field &amp; 0x1F) == 0x7"/>
              <edc:SFRFieldSemantic edc:cname="GND" edc:desc="Internal Ground" edc:when="(field &amp; 0x1F) == 0x18"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="DSEQSTOP" edc:desc="Stop DMA Sequencing" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x43002006" edc:access="----nnnn---nnnnn" edc:cname="CTRLB" edc:impl="0xF1F" edc:mclr="0000000000000000" edc:nzwidth="0x10" edc:por="0000000000000000" ltx:memberofperipheral="ADC1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ADC1">
            <edc:SFRFieldDef edc:cname="LEFTADJ" edc:desc="Left-Adjusted Result" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FREERUN" edc:desc="Free Running Mode" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CORREN" edc:desc="Digital Correction Logic Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RESSEL" edc:desc="Conversion Result Resolution" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="12BIT" edc:desc="12-bit result" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="16BIT" edc:desc="For averaging mode output" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="10BIT" edc:desc="10-bit result" edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="8BIT" edc:desc="8-bit result" edc:when="(field &amp; 0x3) == 0x3"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="WINMODE" edc:desc="Window Monitor Mode" edc:nzwidth="0x3">
              <edc:SFRFieldSemantic edc:cname="DISABLE" edc:desc="No window mode (default)" edc:when="(field &amp; 0x7) == 0"/>
              <edc:SFRFieldSemantic edc:cname="MODE1" edc:desc="RESULT &gt; WINLT" edc:when="(field &amp; 0x7) == 1"/>
              <edc:SFRFieldSemantic edc:cname="MODE2" edc:desc="RESULT &lt; WINUT" edc:when="(field &amp; 0x7) == 2"/>
              <edc:SFRFieldSemantic edc:cname="MODE3" edc:desc="WINLT &lt; RESULT &lt; WINUT" edc:when="(field &amp; 0x7) == 3"/>
              <edc:SFRFieldSemantic edc:cname="MODE4" edc:desc="!(WINLT &lt; RESULT &lt; WINUT)" edc:when="(field &amp; 0x7) == 4"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="WINSS" edc:desc="Window Single Sample" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x43002008" edc:access="n---nnnn" edc:cname="REFCTRL" edc:impl="0x8F" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="ADC1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ADC1">
            <edc:SFRFieldDef edc:cname="REFSEL" edc:desc="Reference Selection" edc:nzwidth="0x4">
              <edc:SFRFieldSemantic edc:cname="INTREF" edc:desc="Internal Bandgap Reference" edc:when="(field &amp; 0xF) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="INTVCC0" edc:desc="1/2 VDDANA" edc:when="(field &amp; 0xF) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="INTVCC1" edc:desc="VDDANA" edc:when="(field &amp; 0xF) == 0x3"/>
              <edc:SFRFieldSemantic edc:cname="AREFA" edc:desc="External Reference" edc:when="(field &amp; 0xF) == 0x4"/>
              <edc:SFRFieldSemantic edc:cname="AREFB" edc:desc="External Reference" edc:when="(field &amp; 0xF) == 0x5"/>
              <edc:SFRFieldSemantic edc:cname="AREFC" edc:desc="External Reference (only on ADC1)" edc:when="(field &amp; 0xF) == 0x6"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="REFCOMP" edc:desc="Reference Buffer Offset Compensation Enable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x43002009" edc:offset="0x1"/>
      <edc:SFRDef edc:_addr="0x4300200A" edc:access="-nnnnnnn" edc:cname="AVGCTRL" edc:impl="0x7F" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="ADC1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ADC1">
            <edc:SFRFieldDef edc:cname="SAMPLENUM" edc:desc="Number of Samples to be Collected" edc:nzwidth="0x4">
              <edc:SFRFieldSemantic edc:cname="1" edc:desc="1 sample" edc:when="(field &amp; 0xF) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="2" edc:desc="2 samples" edc:when="(field &amp; 0xF) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="4" edc:desc="4 samples" edc:when="(field &amp; 0xF) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="8" edc:desc="8 samples" edc:when="(field &amp; 0xF) == 0x3"/>
              <edc:SFRFieldSemantic edc:cname="16" edc:desc="16 samples" edc:when="(field &amp; 0xF) == 0x4"/>
              <edc:SFRFieldSemantic edc:cname="32" edc:desc="32 samples" edc:when="(field &amp; 0xF) == 0x5"/>
              <edc:SFRFieldSemantic edc:cname="64" edc:desc="64 samples" edc:when="(field &amp; 0xF) == 0x6"/>
              <edc:SFRFieldSemantic edc:cname="128" edc:desc="128 samples" edc:when="(field &amp; 0xF) == 0x7"/>
              <edc:SFRFieldSemantic edc:cname="256" edc:desc="256 samples" edc:when="(field &amp; 0xF) == 0x8"/>
              <edc:SFRFieldSemantic edc:cname="512" edc:desc="512 samples" edc:when="(field &amp; 0xF) == 0x9"/>
              <edc:SFRFieldSemantic edc:cname="1024" edc:desc="1024 samples" edc:when="(field &amp; 0xF) == 0xA"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="ADJRES" edc:desc="Adjusting Result / Division Coefficient" edc:nzwidth="0x3"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4300200B" edc:access="n-nnnnnn" edc:cname="SAMPCTRL" edc:impl="0xBF" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="ADC1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ADC1">
            <edc:SFRFieldDef edc:cname="SAMPLEN" edc:desc="Sampling Time Length" edc:nzwidth="0x6"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="OFFCOMP" edc:desc="Comparator Offset Compensation Enable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4300200C" edc:access="nnnnnnnnnnnnnnnn" edc:cname="WINLT" edc:mclr="0000000000000000" edc:nzwidth="0x10" edc:por="0000000000000000" ltx:memberofperipheral="ADC1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ADC1">
            <edc:SFRFieldDef edc:cname="WINLT" edc:desc="Window Lower Threshold" edc:nzwidth="0x10"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4300200E" edc:access="nnnnnnnnnnnnnnnn" edc:cname="WINUT" edc:mclr="0000000000000000" edc:nzwidth="0x10" edc:por="0000000000000000" ltx:memberofperipheral="ADC1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ADC1">
            <edc:SFRFieldDef edc:cname="WINUT" edc:desc="Window Upper Threshold" edc:nzwidth="0x10"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x43002010" edc:access="----nnnnnnnnnnnn" edc:cname="GAINCORR" edc:impl="0xFFF" edc:mclr="0000000000000000" edc:nzwidth="0x10" edc:por="0000000000000000" ltx:memberofperipheral="ADC1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ADC1">
            <edc:SFRFieldDef edc:cname="GAINCORR" edc:desc="Gain Correction Value" edc:nzwidth="0xC"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x43002012" edc:access="----nnnnnnnnnnnn" edc:cname="OFFSETCORR" edc:impl="0xFFF" edc:mclr="0000000000000000" edc:nzwidth="0x10" edc:por="0000000000000000" ltx:memberofperipheral="ADC1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ADC1">
            <edc:SFRFieldDef edc:cname="OFFSETCORR" edc:desc="Offset Correction Value" edc:nzwidth="0xC"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
