adafruit/seesaw/lib/samd51/samd51a/edc/ATSAMD51P20A.PIC
      <edc:AdjustPoint edc:_addr="0x45000070" edc:offset="0x8C"/>
      <edc:SFRDef edc:_addr="0x450000FC" edc:access="---------------r" edc:cname="SISR" edc:impl="0x1" edc:mclr="100000000000000000" edc:nzwidth="0x10" edc:por="100000000000000000" ltx:memberofperipheral="SDHC0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SDHC0">
            <edc:SFRFieldDef edc:cname="INTSSL" edc:desc="Interrupt Signal for Each Slot" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x450000FE" edc:access="rrrrrrrrrrrrrrrr" edc:cname="HCVR" edc:mclr="0001100000000010" edc:nzwidth="0x10" edc:por="0001100000000010" ltx:memberofperipheral="SDHC0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SDHC0">
            <edc:SFRFieldDef edc:cname="SVER" edc:desc="Spec Version" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="VVER" edc:desc="Vendor Version" edc:nzwidth="0x8"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x45000100" edc:offset="0x104"/>
      <edc:SFRDef edc:_addr="0x45000204" edc:access="nnnnn-nn" edc:cname="MC1R" edc:impl="0xFB" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="SDHC0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SDHC0">
            <edc:SFRFieldDef edc:cname="CMDTYP" edc:desc="e.MMC Command Type" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="NORMAL" edc:desc="Not a MMC specific command" edc:when="(field &amp; 0x3) == 0"/>
              <edc:SFRFieldSemantic edc:cname="WAITIRQ" edc:desc="Wait IRQ Command" edc:when="(field &amp; 0x3) == 1"/>
              <edc:SFRFieldSemantic edc:cname="STREAM" edc:desc="Stream Command" edc:when="(field &amp; 0x3) == 2"/>
              <edc:SFRFieldSemantic edc:cname="BOOT" edc:desc="Boot Command" edc:when="(field &amp; 0x3) == 3"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="DDR" edc:desc="e.MMC HSDDR Mode" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OPD" edc:desc="e.MMC Open Drain Mode" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="BOOTA" edc:desc="e.MMC Boot Acknowledge Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RSTN" edc:desc="e.MMC Reset Signal" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FCD" edc:desc="e.MMC Force Card Detect" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x45000205" edc:access="------ww" edc:cname="MC2R" edc:impl="0x3" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="SDHC0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SDHC0">
            <edc:SFRFieldDef edc:cname="SRESP" edc:desc="e.MMC Abort Wait IRQ" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ABOOT" edc:desc="e.MMC Abort Boot" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x45000206" edc:offset="0x2"/>
      <edc:SFRDef edc:_addr="0x45000208" edc:access="------------------------------nn" edc:cname="ACR" edc:impl="0x3" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="SDHC0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SDHC0">
            <edc:SFRFieldDef edc:cname="BMAX" edc:desc="AHB Maximum Burst" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="INCR16" edc:when="(field &amp; 0x3) == 0"/>
              <edc:SFRFieldSemantic edc:cname="INCR8" edc:when="(field &amp; 0x3) == 1"/>
              <edc:SFRFieldSemantic edc:cname="INCR4" edc:when="(field &amp; 0x3) == 2"/>
              <edc:SFRFieldSemantic edc:cname="SINGLE" edc:when="(field &amp; 0x3) == 3"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4500020C" edc:access="-------------------------------n" edc:cname="CC2R" edc:impl="0x1" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="SDHC0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SDHC0">
            <edc:SFRFieldDef edc:cname="FSDCLKD" edc:desc="Force SDCK Disabled" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="NOEFFECT" edc:desc="No effect" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="DISABLE" edc:desc="SDCLK can be stopped at any time after DATA transfer.SDCLK enable forcing for 8 SDCLK cycles is disabled" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x45000210" edc:offset="0x20"/>
      <edc:SFRDef edc:_addr="0x45000230" edc:access="----------------nnnnnnnn-------n" edc:cname="CACR" edc:impl="0xFF01" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="SDHC0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SDHC0">
            <edc:SFRFieldDef edc:cname="CAPWREN" edc:desc="Capabilities Registers Write Enable (Required to write the correct frequencies in the Capabilities Registers)" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x7"/>
            <edc:SFRFieldDef edc:cname="KEY" edc:desc="Key (0x46)" edc:nzwidth="0x8"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x45000234" edc:access="-------n" edc:cname="DBGR" edc:impl="0x1" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="SDHC0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SDHC0">
            <edc:SFRFieldDef edc:cname="NIDBG" edc:desc="Non-intrusive debug enable" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="IDBG" edc:desc="Debugging is intrusive (reads of BDPR from debugger are considered and increment the internal buffer pointer)" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="NIDBG" edc:desc="Debugging is not intrusive (reads of BDPR from debugger are discarded and do not increment the internal buffer pointer)" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
    </edc:SFRDataSector>
    <edc:SFRDataSector edc:beginaddr="0x46000000" edc:endaddr="0x46000238" edc:regionid="SDHC1">
      <edc:SFRDef edc:_addr="0x46000000" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="SSAR" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="SDHC1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SDHC1">
            <edc:SFRFieldDef edc:cname="ARG2" edc:desc="Argument 2" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x46000004" edc:access="-nnn--nnnnnnnnnn" edc:cname="BSR" edc:impl="0x73FF" edc:mclr="0000000000000000" edc:nzwidth="0x10" edc:por="0000000000000000" ltx:memberofperipheral="SDHC1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SDHC1">
            <edc:SFRFieldDef edc:cname="BLOCKSIZE" edc:desc="Transfer Block Size" edc:nzwidth="0xA"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="BOUNDARY" edc:desc="SDMA Buffer Boundary" edc:nzwidth="0x3">
              <edc:SFRFieldSemantic edc:cname="4K" edc:desc="4k bytes" edc:when="(field &amp; 0x7) == 0"/>
              <edc:SFRFieldSemantic edc:cname="8K" edc:desc="8k bytes" edc:when="(field &amp; 0x7) == 1"/>
              <edc:SFRFieldSemantic edc:cname="16K" edc:desc="16k bytes" edc:when="(field &amp; 0x7) == 2"/>
              <edc:SFRFieldSemantic edc:cname="32K" edc:desc="32k bytes" edc:when="(field &amp; 0x7) == 3"/>
              <edc:SFRFieldSemantic edc:cname="64K" edc:desc="64k bytes" edc:when="(field &amp; 0x7) == 4"/>
              <edc:SFRFieldSemantic edc:cname="128K" edc:desc="128k bytes" edc:when="(field &amp; 0x7) == 5"/>
              <edc:SFRFieldSemantic edc:cname="256K" edc:desc="256k bytes" edc:when="(field &amp; 0x7) == 6"/>
              <edc:SFRFieldSemantic edc:cname="512K" edc:desc="512k bytes" edc:when="(field &amp; 0x7) == 7"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x46000006" edc:access="nnnnnnnnnnnnnnnn" edc:cname="BCR" edc:mclr="0000000000000000" edc:nzwidth="0x10" edc:por="0000000000000000" ltx:memberofperipheral="SDHC1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SDHC1">
            <edc:SFRFieldDef edc:cname="BCNT" edc:desc="Blocks Count for Current Transfer" edc:nzwidth="0x10"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x46000008" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="ARG1R" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="SDHC1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SDHC1">
            <edc:SFRFieldDef edc:cname="ARG" edc:desc="Argument 1" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4600000C" edc:access="----------nnnnnn" edc:cname="TMR" edc:impl="0x3F" edc:mclr="0000000000000000" edc:nzwidth="0x10" edc:por="0000000000000000" ltx:memberofperipheral="SDHC1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SDHC1">
            <edc:SFRFieldDef edc:cname="DMAEN" edc:desc="DMA Enable" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="DISABLE" edc:desc="No data transfer or Non DMA data transfer" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="ENABLE" edc:desc="DMA data transfer" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="BCEN" edc:desc="Block Count Enable" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="DISABLE" edc:desc="Disable" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="ENABLE" edc:desc="Enable" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="ACMDEN" edc:desc="Auto Command Enable" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="DISABLED" edc:desc="Auto Command Disabled" edc:when="(field &amp; 0x3) == 0"/>
              <edc:SFRFieldSemantic edc:cname="CMD12" edc:desc="Auto CMD12 Enable" edc:when="(field &amp; 0x3) == 1"/>
              <edc:SFRFieldSemantic edc:cname="CMD23" edc:desc="Auto CMD23 Enable" edc:when="(field &amp; 0x3) == 2"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="DTDSEL" edc:desc="Data Transfer Direction Selection" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="WRITE" edc:desc="Write (Host to Card)" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="READ" edc:desc="Read (Card to Host)" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="MSBSEL" edc:desc="Multi/Single Block Selection" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="SINGLE" edc:desc="Single Block" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="MULTIPLE" edc:desc="Multiple Block" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4600000E" edc:access="--nnnnnnnnnnn-nn" edc:cname="CR" edc:impl="0x3FFB" edc:mclr="0000000000000000" edc:nzwidth="0x10" edc:por="0000000000000000" ltx:memberofperipheral="SDHC1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SDHC1">
            <edc:SFRFieldDef edc:cname="RESPTYP" edc:desc="Response Type" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="NONE" edc:desc="No response" edc:when="(field &amp; 0x3) == 0"/>
              <edc:SFRFieldSemantic edc:cname="136_BIT" edc:desc="136-bit response" edc:when="(field &amp; 0x3) == 1"/>
              <edc:SFRFieldSemantic edc:cname="48_BIT" edc:desc="48-bit response" edc:when="(field &amp; 0x3) == 2"/>
              <edc:SFRFieldSemantic edc:cname="48_BIT_BUSY" edc:desc="48-bit response check busy after response" edc:when="(field &amp; 0x3) == 3"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="CMDCCEN" edc:desc="Command CRC Check Enable" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="DISABLE" edc:desc="Disable" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="ENABLE" edc:desc="Enable" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="CMDICEN" edc:desc="Command Index Check Enable" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="DISABLE" edc:desc="Disable" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="ENABLE" edc:desc="Enable" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="DPSEL" edc:desc="Data Present Select" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="NO_DATA" edc:desc="No Data Present" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="DATA" edc:desc="Data Present" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="CMDTYP" edc:desc="Command Type" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="NORMAL" edc:desc="Other commands" edc:when="(field &amp; 0x3) == 0"/>
              <edc:SFRFieldSemantic edc:cname="SUSPEND" edc:desc="CMD52 for writing Bus Suspend in CCCR" edc:when="(field &amp; 0x3) == 1"/>
              <edc:SFRFieldSemantic edc:cname="RESUME" edc:desc="CMD52 for writing Function Select in CCCR" edc:when="(field &amp; 0x3) == 2"/>
              <edc:SFRFieldSemantic edc:cname="ABORT" edc:desc="CMD12, CMD52 for writing I/O Abort in CCCR" edc:when="(field &amp; 0x3) == 3"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="CMDIDX" edc:desc="Command Index" edc:nzwidth="0x6"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x46000010" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:cname="RR0" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="SDHC1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SDHC1">
            <edc:SFRFieldDef edc:cname="CMDRESP" edc:desc="Command Response" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x46000014" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:cname="RR1" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="SDHC1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SDHC1">
            <edc:SFRFieldDef edc:cname="CMDRESP" edc:desc="Command Response" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x46000018" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:cname="RR2" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="SDHC1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SDHC1">
            <edc:SFRFieldDef edc:cname="CMDRESP" edc:desc="Command Response" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4600001C" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:cname="RR3" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="SDHC1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SDHC1">
            <edc:SFRFieldDef edc:cname="CMDRESP" edc:desc="Command Response" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x46000020" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="BDPR" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="SDHC1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SDHC1">
            <edc:SFRFieldDef edc:cname="BUFDATA" edc:desc="Buffer Data" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x46000024" edc:access="-------rrrrrrrrr----rrrr----rrrr" edc:cname="PSR" edc:impl="0x1FF0F0F" edc:mclr="00000000111110000000000000000000" edc:nzwidth="0x20" edc:por="00000000111110000000000000000000" ltx:memberofperipheral="SDHC1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SDHC1">
            <edc:SFRFieldDef edc:cname="CMDINHC" edc:desc="Command Inhibit (CMD)" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="CAN" edc:desc="Can issue command using only CMD line" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="CANNOT" edc:desc="Cannot issue command" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="CMDINHD" edc:desc="Command Inhibit (DAT)" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="CAN" edc:desc="Can issue command which uses the DAT line" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="CANNOT" edc:desc="Cannot issue command which uses the DAT line" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="DLACT" edc:desc="DAT Line Active" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="INACTIVE" edc:desc="DAT Line Inactive" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="ACTIVE" edc:desc="DAT Line Active" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="RTREQ" edc:desc="Re-Tuning Request" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="OK" edc:desc="Fixed or well-tuned sampling clock" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="REQUIRED" edc:desc="Sampling clock needs re-tuning" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="WTACT" edc:desc="Write Transfer Active" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="NO" edc:desc="No valid data" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="YES" edc:desc="Transferring data" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="RTACT" edc:desc="Read Transfer Active" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="NO" edc:desc="No valid data" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="YES" edc:desc="Transferring data" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="BUFWREN" edc:desc="Buffer Write Enable" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="DISABLE" edc:desc="Write disable" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="ENABLE" edc:desc="Write enable" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="BUFRDEN" edc:desc="Buffer Read Enable" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="DISABLE" edc:desc="Read disable" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="ENABLE" edc:desc="Read enable" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="CARDINS" edc:desc="Card Inserted" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="NO" edc:desc="Reset or Debouncing or No Card" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="YES" edc:desc="Card inserted" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="CARDSS" edc:desc="Card State Stable" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="NO" edc:desc="Reset or Debouncing" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="YES" edc:desc="No Card or Insered" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="CARDDPL" edc:desc="Card Detect Pin Level" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="NO" edc:desc="No card present (SDCD#=1)" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="YES" edc:desc="Card present (SDCD#=0)" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="WRPPL" edc:desc="Write Protect Pin Level" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="PROTECTED" edc:desc="Write protected (SDWP#=0)" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="ENABLED" edc:desc="Write enabled (SDWP#=1)" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="DATLL" edc:desc="DAT[3:0] Line Level" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="CMDLL" edc:desc="CMD Line Level" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
