adafruit/seesaw/lib/samd51/samd51a/edc/ATSAMD51P20A.PIC
      <edc:SFRDef edc:_addr="0xE000ED34" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="MMFAR" edc:nzwidth="0x20" ltx:memberofperipheral="SystemControl">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SystemControl">
            <edc:SFRFieldDef edc:cname="ADDRESS" edc:desc="Address that generated the MemManage fault" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0xE000ED38" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="BFAR" edc:nzwidth="0x20" ltx:memberofperipheral="SystemControl">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SystemControl">
            <edc:SFRFieldDef edc:cname="ADDRESS" edc:desc="Address that generated the BusFault" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0xE000ED3C" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="AFSR" edc:nzwidth="0x20" ltx:memberofperipheral="SystemControl">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SystemControl">
            <edc:SFRFieldDef edc:cname="IMPDEF" edc:desc="AUXFAULT input signals" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0xE000ED40" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="PFR0" edc:nzwidth="0x20" ltx:memberofperipheral="SystemControl"/>
      <edc:SFRDef edc:_addr="0xE000ED44" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="PFR1" edc:nzwidth="0x20" ltx:memberofperipheral="SystemControl"/>
      <edc:SFRDef edc:_addr="0xE000ED48" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:cname="DFR" edc:nzwidth="0x20" ltx:memberofperipheral="SystemControl"/>
      <edc:SFRDef edc:_addr="0xE000ED4C" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:cname="ADR" edc:nzwidth="0x20" ltx:memberofperipheral="SystemControl"/>
      <edc:SFRDef edc:_addr="0xE000ED50" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:cname="MMFR0" edc:nzwidth="0x20" ltx:memberofperipheral="SystemControl"/>
      <edc:SFRDef edc:_addr="0xE000ED54" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:cname="MMFR1" edc:nzwidth="0x20" ltx:memberofperipheral="SystemControl"/>
      <edc:SFRDef edc:_addr="0xE000ED58" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:cname="MMFR2" edc:nzwidth="0x20" ltx:memberofperipheral="SystemControl"/>
      <edc:SFRDef edc:_addr="0xE000ED5C" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:cname="MMFR3" edc:nzwidth="0x20" ltx:memberofperipheral="SystemControl"/>
      <edc:SFRDef edc:_addr="0xE000ED60" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:cname="ISAR0" edc:nzwidth="0x20" ltx:memberofperipheral="SystemControl"/>
      <edc:SFRDef edc:_addr="0xE000ED64" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:cname="ISAR1" edc:nzwidth="0x20" ltx:memberofperipheral="SystemControl"/>
      <edc:SFRDef edc:_addr="0xE000ED68" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:cname="ISAR2" edc:nzwidth="0x20" ltx:memberofperipheral="SystemControl"/>
      <edc:SFRDef edc:_addr="0xE000ED6C" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:cname="ISAR3" edc:nzwidth="0x20" ltx:memberofperipheral="SystemControl"/>
      <edc:SFRDef edc:_addr="0xE000ED70" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:cname="ISAR4" edc:nzwidth="0x20" ltx:memberofperipheral="SystemControl"/>
      <edc:AdjustPoint edc:_addr="0xE000ED74" edc:offset="0x14"/>
      <edc:SFRDef edc:_addr="0xE000ED88" edc:access="--------nnnn--------------------" edc:cname="CPACR" edc:impl="0xF00000" edc:nzwidth="0x20" ltx:memberofperipheral="SystemControl">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SystemControl">
            <edc:AdjustPoint edc:offset="0x14"/>
            <edc:SFRFieldDef edc:cname="CP10" edc:desc="Access privileges for coprocessor 10" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="DENIED" edc:desc="Access denied" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="PRIV" edc:desc="Privileged access only" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="FULL" edc:desc="Full access" edc:when="(field &amp; 0x3) == 0x3"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="CP11" edc:desc="Access privileges for coprocessor 11" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="DENIED" edc:desc="Access denied" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="PRIV" edc:desc="Privileged access only" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="FULL" edc:desc="Full access" edc:when="(field &amp; 0x3) == 0x3"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0xE000ED8C" edc:offset="0x4"/>
      <edc:SFRDef edc:_addr="0xE000ED90" edc:access="--------rrrrrrrrrrrrrrrr-------r" edc:cname="TYPE" edc:impl="0xFFFF01" edc:nzwidth="0x20" ltx:memberofperipheral="MPU">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MPU">
            <edc:SFRFieldDef edc:cname="SEPARATE" edc:desc="Separate instruction and Data Memory MapsRegions" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x7"/>
            <edc:SFRFieldDef edc:cname="DREGION" edc:desc="Number of Data Regions" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="IREGION" edc:desc="Number of Instruction Regions" edc:nzwidth="0x8"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0xE000ED94" edc:access="-----------------------------nnn" edc:cname="CTRL" edc:impl="0x7" edc:nzwidth="0x20" ltx:memberofperipheral="MPU">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MPU">
            <edc:SFRFieldDef edc:cname="ENABLE" edc:desc="MPU Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="HFNMIENA" edc:desc="Enable Hard Fault and NMI handlers" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PRIVDEFENA" edc:desc="Enables privileged software access to default memory map" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0xE000ED98" edc:access="------------------------nnnnnnnn" edc:cname="RNR" edc:impl="0xFF" edc:nzwidth="0x20" ltx:memberofperipheral="MPU">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MPU">
            <edc:SFRFieldDef edc:cname="REGION" edc:desc="Region referenced by RBAR and RASR" edc:nzwidth="0x8"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
